zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_TMR_BASE.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_NETC_TMR_BASE.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_NETC_TMR_BASE
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_NETC_TMR_BASE_H_)  /* Check if memory map has not been already included */
#define S32K566_NETC_TMR_BASE_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- NETC_TMR_BASE Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup NETC_TMR_BASE_Peripheral_Access_Layer NETC_TMR_BASE Peripheral Access Layer
 * @{
 */

/** NETC_TMR_BASE - Size of Registers Arrays */
#define NETC_TMR_BASE_ALL_REG_ARRAYS_TMR_ALARMM_COUNT 2u
#define NETC_TMR_BASE_ALL_REG_ARRAYS_TMR_FIPERF_COUNT 3u
#define NETC_TMR_BASE_ALL_REG_ARRAYS_TMR_ETTSN_COUNT 2u
#define NETC_TMR_BASE_ALL_REG_ARRAYS_COUNT        1u
#define NETC_TMR_BASE_AVTP_NUM_COUNT              4u

/** NETC_TMR_BASE - Register Layout Typedef */
typedef struct NETC_TMR_BASE_Struct {
  struct NETC_TMR_BASE_ALL_REG_ARRAYS {            /* offset: 0x0, array step: 0xFC */
    __I  uint32_t TMR_ID;                            /**< Module ID, array offset: 0x0, array step: 0xFC */
    uint8_t RESERVED_0[4];
    __I  uint32_t TMR_CAPR;                          /**< Timer Capability, array offset: 0x8, array step: 0xFC */
    uint8_t RESERVED_1[20];
    __I  uint32_t TMR_FRT_L;                         /**< Timer Free Running Time Low, array offset: 0x20, array step: 0xFC */
    __I  uint32_t TMR_FRT_H;                         /**< Timer Free Running Time High, array offset: 0x24, array step: 0xFC */
    __I  uint32_t TMR_SRT_L;                         /**< Timer Synchronous Time Low, array offset: 0x28, array step: 0xFC */
    __I  uint32_t TMR_SRT_H;                         /**< Timer Synchronous Time High, array offset: 0x2C, array step: 0xFC */
    __I  uint32_t TMR_DEF_CNT_L;                     /**< Default Nanosecond Timer Counter Low, array offset: 0x30, array step: 0xFC */
    __I  uint32_t TMR_DEF_CNT_H;                     /**< Default Nanosecond Timer Counter High, array offset: 0x34, array step: 0xFC */
    uint8_t RESERVED_2[72];
    __IO uint32_t TMR_CTRL;                          /**< Timer Control, array offset: 0x80, array step: 0xFC */
    __IO uint32_t TMR_TEVENT;                        /**< Timer Event, array offset: 0x84, array step: 0xFC */
    __IO uint32_t TMR_TEMASK;                        /**< Timer Event Mask, array offset: 0x88, array step: 0xFC */
    __IO uint32_t TMR_MSIVEC;                        /**< Timer MSI-X Vector, array offset: 0x8C, array step: 0xFC */
    uint8_t RESERVED_3[4];
    __I  uint32_t TMR_STAT;                          /**< Timer Status, array offset: 0x94, array step: 0xFC */
    __IO uint32_t TMR_CNT_L;                         /**< Timer Counter Low, array offset: 0x98, array step: 0xFC */
    __IO uint32_t TMR_CNT_H;                         /**< Timer Counter High, array offset: 0x9C, array step: 0xFC */
    __IO uint32_t TMR_ADD;                           /**< Timer Addend, array offset: 0xA0, array step: 0xFC */
    __I  uint32_t TMR_ACC;                           /**< Timer Accumulator, array offset: 0xA4, array step: 0xFC */
    __IO uint32_t TMR_PRSC;                          /**< Timer Prescale, array offset: 0xA8, array step: 0xFC */
    __IO uint32_t TMR_ECTRL;                         /**< Extended Timer Control, array offset: 0xAC, array step: 0xFC */
    __IO uint32_t TMROFF_L;                          /**< Timer Offset Low, array offset: 0xB0, array step: 0xFC */
    __IO uint32_t TMROFF_H;                          /**< Timer Offset High, array offset: 0xB4, array step: 0xFC */
    struct NETC_TMR_BASE_ALL_REG_ARRAYS_TMR_ALARMM {    /* offset: 0xB8, array step: index*0xFC, index2*0x8 */
      __IO uint32_t TMR_ALARM_L;                       /**< Alarm Time Comparator Low, array offset: 0xB8, array step: index*0xFC, index2*0x8 */
      __IO uint32_t TMR_ALARM_H;                       /**< Alarm Time Comparator High, array offset: 0xBC, array step: index*0xFC, index2*0x8 */
    } TMR_ALARMM[NETC_TMR_BASE_ALL_REG_ARRAYS_TMR_ALARMM_COUNT];
    uint8_t RESERVED_4[4];
    __IO uint32_t TMR_ALARM_CTRL;                    /**< Timer Alarm Control, array offset: 0xCC, array step: 0xFC */
    __IO uint32_t TMR_FIPER[NETC_TMR_BASE_ALL_REG_ARRAYS_TMR_FIPERF_COUNT];   /**< Timer Fixed-Interval Period, array offset: 0xD0, array step: index*0xFC, index2*0x4 */
    __IO uint32_t TMR_FIPER_CTRL;                    /**< Timer FIPER Control, array offset: 0xDC, array step: 0xFC */
    struct NETC_TMR_BASE_ALL_REG_ARRAYS_TMR_ETTSN {    /* offset: 0xE0, array step: index*0xFC, index2*0x8 */
      __I  uint32_t TMR_ETTS_L;                        /**< External Trigger Stamp Low, array offset: 0xE0, array step: index*0xFC, index2*0x8 */
      __I  uint32_t TMR_ETTS_H;                        /**< External Trigger Stamp High, array offset: 0xE4, array step: index*0xFC, index2*0x8 */
    } TMR_ETTSN[NETC_TMR_BASE_ALL_REG_ARRAYS_TMR_ETTSN_COUNT];
    __I  uint32_t TMR_CUR_TIME_L;                    /**< Timer Current Time Low, array offset: 0xF0, array step: 0xFC */
    __I  uint32_t TMR_CUR_TIME_H;                    /**< Timer Current Time High, array offset: 0xF4, array step: 0xFC */
    __IO uint32_t TMR_PARAM;                         /**< Timer Parameter, array offset: 0xF8, array step: 0xFC */
  } ALL_REG_ARRAYS[NETC_TMR_BASE_ALL_REG_ARRAYS_COUNT];
  uint8_t RESERVED_0[130828];
  __I  uint32_t TM_CAPR;                           /**< Timer Media Capability, offset: 0x20008 */
  uint8_t RESERVED_1[244];
  struct NETC_TMR_BASE_AVTP_NUM {                  /* offset: 0x20100, array step: 0x20 */
    __IO uint32_t PTCMR;                             /**< Timer Control Mode 0..Timer Control Mode 3, array offset: 0x20100, array step: 0x20 */
    __I  uint32_t PTCSR;                             /**< Timer Control Status 0..Timer Control Status 3, array offset: 0x20104, array step: 0x20 */
    __IO uint32_t PTSTDR;                            /**< Timestamp Transit Delay 0..Timestamp Transit Delay 3, array offset: 0x20108, array step: 0x20 */
    __IO uint32_t PTCCR;                             /**< Timer Compare Capture 0..Timer Compare Capture 3, array offset: 0x2010C, array step: 0x20 */
    __IO uint32_t PTSAUBAR;                          /**< Timestamp Array Upper Base 0..Timestamp Array Upper Base 3, array offset: 0x20110, array step: 0x20 */
    __IO uint32_t PTSALBAR;                          /**< Timestamp Array Lower Base 0..Timestamp Array Lower Base 3, array offset: 0x20114, array step: 0x20 */
    __IO uint32_t PTSACIR;                           /**< Timestamp Array Consumer Index 0..Timestamp Array Consumer Index 3, array offset: 0x20118, array step: 0x20 */
    __IO uint32_t PTSAPIR;                           /**< Timestamp Array Producer Index 0..Timestamp Array Producer Index 3, array offset: 0x2011C, array step: 0x20 */
  } AVTP_NUM[NETC_TMR_BASE_AVTP_NUM_COUNT];
  uint8_t RESERVED_2[32];
  __IO uint32_t PIER;                              /**< Interrupt Enable, offset: 0x201A0 */
  __IO uint32_t PIDR;                              /**< Interrupt Detect, offset: 0x201A4 */
  __IO uint32_t PMSIVR;                            /**< MSI-X Vector, offset: 0x201A8 */
  uint8_t RESERVED_3[4];
  __IO uint32_t TMR_CAR;                           /**< Timer Interface Cache Attribute 0, offset: 0x201B0 */
} NETC_TMR_BASE_Type, *NETC_TMR_BASE_MemMapPtr;

/** Number of instances of the NETC_TMR_BASE module. */
#define NETC_TMR_BASE_INSTANCE_COUNT             (1u)

/* NETC_TMR_BASE - Peripheral instance base addresses */
/** Peripheral NETC__TMR0_BASE base address */
#define IP_NETC__TMR0_BASE_BASE                  (0x6D0C0000u)
/** Peripheral NETC__TMR0_BASE base pointer */
#define IP_NETC__TMR0_BASE                       ((NETC_TMR_BASE_Type *)IP_NETC__TMR0_BASE_BASE)
/** Array initializer of NETC_TMR_BASE peripheral base addresses */
#define IP_NETC_TMR_BASE_BASE_ADDRS              { IP_NETC__TMR0_BASE_BASE }
/** Array initializer of NETC_TMR_BASE peripheral base pointers */
#define IP_NETC_TMR_BASE_BASE_PTRS               { IP_NETC__TMR0_BASE }

/* ----------------------------------------------------------------------------
   -- NETC_TMR_BASE Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup NETC_TMR_BASE_Register_Masks NETC_TMR_BASE Register Masks
 * @{
 */

/*! @name TMR_ID - Module ID */
/*! @{ */

#define NETC_TMR_BASE_TMR_ID_REV_MN_MASK         (0xFFU)
#define NETC_TMR_BASE_TMR_ID_REV_MN_SHIFT        (0U)
#define NETC_TMR_BASE_TMR_ID_REV_MN_WIDTH        (8U)
#define NETC_TMR_BASE_TMR_ID_REV_MN(x)           (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_ID_REV_MN_SHIFT)) & NETC_TMR_BASE_TMR_ID_REV_MN_MASK)

#define NETC_TMR_BASE_TMR_ID_REV_MJ_MASK         (0xFF00U)
#define NETC_TMR_BASE_TMR_ID_REV_MJ_SHIFT        (8U)
#define NETC_TMR_BASE_TMR_ID_REV_MJ_WIDTH        (8U)
#define NETC_TMR_BASE_TMR_ID_REV_MJ(x)           (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_ID_REV_MJ_SHIFT)) & NETC_TMR_BASE_TMR_ID_REV_MJ_MASK)

#define NETC_TMR_BASE_TMR_ID_TMR_ID_MASK         (0xFFFF0000U)
#define NETC_TMR_BASE_TMR_ID_TMR_ID_SHIFT        (16U)
#define NETC_TMR_BASE_TMR_ID_TMR_ID_WIDTH        (16U)
#define NETC_TMR_BASE_TMR_ID_TMR_ID(x)           (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_ID_TMR_ID_SHIFT)) & NETC_TMR_BASE_TMR_ID_TMR_ID_MASK)
/*! @} */

/*! @name TMR_CAPR - Timer Capability */
/*! @{ */

#define NETC_TMR_BASE_TMR_CAPR_ECADJ_MASK        (0x2U)
#define NETC_TMR_BASE_TMR_CAPR_ECADJ_SHIFT       (1U)
#define NETC_TMR_BASE_TMR_CAPR_ECADJ_WIDTH       (1U)
#define NETC_TMR_BASE_TMR_CAPR_ECADJ(x)          (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_CAPR_ECADJ_SHIFT)) & NETC_TMR_BASE_TMR_CAPR_ECADJ_MASK)

#define NETC_TMR_BASE_TMR_CAPR_IEEE_8021AS_REV_MASK (0x4U)
#define NETC_TMR_BASE_TMR_CAPR_IEEE_8021AS_REV_SHIFT (2U)
#define NETC_TMR_BASE_TMR_CAPR_IEEE_8021AS_REV_WIDTH (1U)
#define NETC_TMR_BASE_TMR_CAPR_IEEE_8021AS_REV(x) (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_CAPR_IEEE_8021AS_REV_SHIFT)) & NETC_TMR_BASE_TMR_CAPR_IEEE_8021AS_REV_MASK)

