zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_TMR_BASE.h
#define NETC_TMR_BASE_TMR_CAPR_IEEE_1722_MASK    (0x200U)
#define NETC_TMR_BASE_TMR_CAPR_IEEE_1722_SHIFT   (9U)
#define NETC_TMR_BASE_TMR_CAPR_IEEE_1722_WIDTH   (1U)
#define NETC_TMR_BASE_TMR_CAPR_IEEE_1722(x)      (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_CAPR_IEEE_1722_SHIFT)) & NETC_TMR_BASE_TMR_CAPR_IEEE_1722_MASK)

#define NETC_TMR_BASE_TMR_CAPR_NUM_MSIX_MASK     (0x10000U)
#define NETC_TMR_BASE_TMR_CAPR_NUM_MSIX_SHIFT    (16U)
#define NETC_TMR_BASE_TMR_CAPR_NUM_MSIX_WIDTH    (1U)
#define NETC_TMR_BASE_TMR_CAPR_NUM_MSIX(x)       (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_CAPR_NUM_MSIX_SHIFT)) & NETC_TMR_BASE_TMR_CAPR_NUM_MSIX_MASK)
/*! @} */

/*! @name TMR_FRT_L - Timer Free Running Time Low */
/*! @{ */

#define NETC_TMR_BASE_TMR_FRT_L_TMR_FRT_L_MASK   (0xFFFFFFFFU)
#define NETC_TMR_BASE_TMR_FRT_L_TMR_FRT_L_SHIFT  (0U)
#define NETC_TMR_BASE_TMR_FRT_L_TMR_FRT_L_WIDTH  (32U)
#define NETC_TMR_BASE_TMR_FRT_L_TMR_FRT_L(x)     (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_FRT_L_TMR_FRT_L_SHIFT)) & NETC_TMR_BASE_TMR_FRT_L_TMR_FRT_L_MASK)
/*! @} */

/*! @name TMR_FRT_H - Timer Free Running Time High */
/*! @{ */

#define NETC_TMR_BASE_TMR_FRT_H_TMR_FRT_H_MASK   (0xFFFFFFFFU)
#define NETC_TMR_BASE_TMR_FRT_H_TMR_FRT_H_SHIFT  (0U)
#define NETC_TMR_BASE_TMR_FRT_H_TMR_FRT_H_WIDTH  (32U)
#define NETC_TMR_BASE_TMR_FRT_H_TMR_FRT_H(x)     (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_FRT_H_TMR_FRT_H_SHIFT)) & NETC_TMR_BASE_TMR_FRT_H_TMR_FRT_H_MASK)
/*! @} */

/*! @name TMR_SRT_L - Timer Synchronous Time Low */
/*! @{ */

#define NETC_TMR_BASE_TMR_SRT_L_TMR_SRT_L_MASK   (0xFFFFFFFFU)
#define NETC_TMR_BASE_TMR_SRT_L_TMR_SRT_L_SHIFT  (0U)
#define NETC_TMR_BASE_TMR_SRT_L_TMR_SRT_L_WIDTH  (32U)
#define NETC_TMR_BASE_TMR_SRT_L_TMR_SRT_L(x)     (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_SRT_L_TMR_SRT_L_SHIFT)) & NETC_TMR_BASE_TMR_SRT_L_TMR_SRT_L_MASK)
/*! @} */

/*! @name TMR_SRT_H - Timer Synchronous Time High */
/*! @{ */

#define NETC_TMR_BASE_TMR_SRT_H_TMR_SRT_H_MASK   (0xFFFFFFFFU)
#define NETC_TMR_BASE_TMR_SRT_H_TMR_SRT_H_SHIFT  (0U)
#define NETC_TMR_BASE_TMR_SRT_H_TMR_SRT_H_WIDTH  (32U)
#define NETC_TMR_BASE_TMR_SRT_H_TMR_SRT_H(x)     (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_SRT_H_TMR_SRT_H_SHIFT)) & NETC_TMR_BASE_TMR_SRT_H_TMR_SRT_H_MASK)
/*! @} */

/*! @name TMR_DEF_CNT_L - Default Nanosecond Timer Counter Low */
/*! @{ */

#define NETC_TMR_BASE_TMR_DEF_CNT_L_TMR_DEF_CNT_L_MASK (0xFFFFFFFFU)
#define NETC_TMR_BASE_TMR_DEF_CNT_L_TMR_DEF_CNT_L_SHIFT (0U)
#define NETC_TMR_BASE_TMR_DEF_CNT_L_TMR_DEF_CNT_L_WIDTH (32U)
#define NETC_TMR_BASE_TMR_DEF_CNT_L_TMR_DEF_CNT_L(x) (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_DEF_CNT_L_TMR_DEF_CNT_L_SHIFT)) & NETC_TMR_BASE_TMR_DEF_CNT_L_TMR_DEF_CNT_L_MASK)
/*! @} */

/*! @name TMR_DEF_CNT_H - Default Nanosecond Timer Counter High */
/*! @{ */

#define NETC_TMR_BASE_TMR_DEF_CNT_H_TMR_DEF_CNT_H_MASK (0xFFFFFFFFU)
#define NETC_TMR_BASE_TMR_DEF_CNT_H_TMR_DEF_CNT_H_SHIFT (0U)
#define NETC_TMR_BASE_TMR_DEF_CNT_H_TMR_DEF_CNT_H_WIDTH (32U)
#define NETC_TMR_BASE_TMR_DEF_CNT_H_TMR_DEF_CNT_H(x) (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_DEF_CNT_H_TMR_DEF_CNT_H_SHIFT)) & NETC_TMR_BASE_TMR_DEF_CNT_H_TMR_DEF_CNT_H_MASK)
/*! @} */

/*! @name TMR_CTRL - Timer Control */
/*! @{ */

#define NETC_TMR_BASE_TMR_CTRL_CK_SEL_MASK       (0x3U)
#define NETC_TMR_BASE_TMR_CTRL_CK_SEL_SHIFT      (0U)
#define NETC_TMR_BASE_TMR_CTRL_CK_SEL_WIDTH      (2U)
#define NETC_TMR_BASE_TMR_CTRL_CK_SEL(x)         (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_CTRL_CK_SEL_SHIFT)) & NETC_TMR_BASE_TMR_CTRL_CK_SEL_MASK)

#define NETC_TMR_BASE_TMR_CTRL_TE_MASK           (0x4U)
#define NETC_TMR_BASE_TMR_CTRL_TE_SHIFT          (2U)
#define NETC_TMR_BASE_TMR_CTRL_TE_WIDTH          (1U)
#define NETC_TMR_BASE_TMR_CTRL_TE(x)             (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_CTRL_TE_SHIFT)) & NETC_TMR_BASE_TMR_CTRL_TE_MASK)

#define NETC_TMR_BASE_TMR_CTRL_TMSR_MASK         (0x20U)
#define NETC_TMR_BASE_TMR_CTRL_TMSR_SHIFT        (5U)
#define NETC_TMR_BASE_TMR_CTRL_TMSR_WIDTH        (1U)
#define NETC_TMR_BASE_TMR_CTRL_TMSR(x)           (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_CTRL_TMSR_SHIFT)) & NETC_TMR_BASE_TMR_CTRL_TMSR_MASK)

#define NETC_TMR_BASE_TMR_CTRL_CIPH_MASK         (0x40U)
#define NETC_TMR_BASE_TMR_CTRL_CIPH_SHIFT        (6U)
#define NETC_TMR_BASE_TMR_CTRL_CIPH_WIDTH        (1U)
#define NETC_TMR_BASE_TMR_CTRL_CIPH(x)           (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_CTRL_CIPH_SHIFT)) & NETC_TMR_BASE_TMR_CTRL_CIPH_MASK)

#define NETC_TMR_BASE_TMR_CTRL_COPH_MASK         (0x80U)
#define NETC_TMR_BASE_TMR_CTRL_COPH_SHIFT        (7U)
#define NETC_TMR_BASE_TMR_CTRL_COPH_WIDTH        (1U)
#define NETC_TMR_BASE_TMR_CTRL_COPH(x)           (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_CTRL_COPH_SHIFT)) & NETC_TMR_BASE_TMR_CTRL_COPH_MASK)

#define NETC_TMR_BASE_TMR_CTRL_ETEP1_MASK        (0x100U)
#define NETC_TMR_BASE_TMR_CTRL_ETEP1_SHIFT       (8U)
#define NETC_TMR_BASE_TMR_CTRL_ETEP1_WIDTH       (1U)
#define NETC_TMR_BASE_TMR_CTRL_ETEP1(x)          (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_CTRL_ETEP1_SHIFT)) & NETC_TMR_BASE_TMR_CTRL_ETEP1_MASK)

#define NETC_TMR_BASE_TMR_CTRL_ETEP2_MASK        (0x200U)
#define NETC_TMR_BASE_TMR_CTRL_ETEP2_SHIFT       (9U)
#define NETC_TMR_BASE_TMR_CTRL_ETEP2_WIDTH       (1U)
#define NETC_TMR_BASE_TMR_CTRL_ETEP2(x)          (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_CTRL_ETEP2_SHIFT)) & NETC_TMR_BASE_TMR_CTRL_ETEP2_MASK)

#define NETC_TMR_BASE_TMR_CTRL_LDR_MASK          (0x800U)
#define NETC_TMR_BASE_TMR_CTRL_LDR_SHIFT         (11U)
#define NETC_TMR_BASE_TMR_CTRL_LDR_WIDTH         (1U)
#define NETC_TMR_BASE_TMR_CTRL_LDR(x)            (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_CTRL_LDR_SHIFT)) & NETC_TMR_BASE_TMR_CTRL_LDR_MASK)

#define NETC_TMR_BASE_TMR_CTRL_PTM_MASK          (0x1000U)
#define NETC_TMR_BASE_TMR_CTRL_PTM_SHIFT         (12U)
#define NETC_TMR_BASE_TMR_CTRL_PTM_WIDTH         (1U)
#define NETC_TMR_BASE_TMR_CTRL_PTM(x)            (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_CTRL_PTM_SHIFT)) & NETC_TMR_BASE_TMR_CTRL_PTM_MASK)

#define NETC_TMR_BASE_TMR_CTRL_COMP_MODE_MASK    (0x8000U)
#define NETC_TMR_BASE_TMR_CTRL_COMP_MODE_SHIFT   (15U)
#define NETC_TMR_BASE_TMR_CTRL_COMP_MODE_WIDTH   (1U)
#define NETC_TMR_BASE_TMR_CTRL_COMP_MODE(x)      (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_CTRL_COMP_MODE_SHIFT)) & NETC_TMR_BASE_TMR_CTRL_COMP_MODE_MASK)

#define NETC_TMR_BASE_TMR_CTRL_TCLK_PERIOD_MASK  (0x3FF0000U)
#define NETC_TMR_BASE_TMR_CTRL_TCLK_PERIOD_SHIFT (16U)
#define NETC_TMR_BASE_TMR_CTRL_TCLK_PERIOD_WIDTH (10U)
#define NETC_TMR_BASE_TMR_CTRL_TCLK_PERIOD(x)    (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_CTRL_TCLK_PERIOD_SHIFT)) & NETC_TMR_BASE_TMR_CTRL_TCLK_PERIOD_MASK)

#define NETC_TMR_BASE_TMR_CTRL_PP2L_MASK         (0x4000000U)
#define NETC_TMR_BASE_TMR_CTRL_PP2L_SHIFT        (26U)
#define NETC_TMR_BASE_TMR_CTRL_PP2L_WIDTH        (1U)
#define NETC_TMR_BASE_TMR_CTRL_PP2L(x)           (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_CTRL_PP2L_SHIFT)) & NETC_TMR_BASE_TMR_CTRL_PP2L_MASK)

#define NETC_TMR_BASE_TMR_CTRL_PP1L_MASK         (0x8000000U)
#define NETC_TMR_BASE_TMR_CTRL_PP1L_SHIFT        (27U)
#define NETC_TMR_BASE_TMR_CTRL_PP1L_WIDTH        (1U)
#define NETC_TMR_BASE_TMR_CTRL_PP1L(x)           (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_CTRL_PP1L_SHIFT)) & NETC_TMR_BASE_TMR_CTRL_PP1L_MASK)

#define NETC_TMR_BASE_TMR_CTRL_FS_MASK           (0x10000000U)
#define NETC_TMR_BASE_TMR_CTRL_FS_SHIFT          (28U)
#define NETC_TMR_BASE_TMR_CTRL_FS_WIDTH          (1U)
#define NETC_TMR_BASE_TMR_CTRL_FS(x)             (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_CTRL_FS_SHIFT)) & NETC_TMR_BASE_TMR_CTRL_FS_MASK)

