zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_TMR_BASE.h
#define NETC_TMR_BASE_TMR_CTRL_SHADOW_DIS_MASK   (0x20000000U)
#define NETC_TMR_BASE_TMR_CTRL_SHADOW_DIS_SHIFT  (29U)
#define NETC_TMR_BASE_TMR_CTRL_SHADOW_DIS_WIDTH  (1U)
#define NETC_TMR_BASE_TMR_CTRL_SHADOW_DIS(x)     (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_CTRL_SHADOW_DIS_SHIFT)) & NETC_TMR_BASE_TMR_CTRL_SHADOW_DIS_MASK)

#define NETC_TMR_BASE_TMR_CTRL_ALM2P_MASK        (0x40000000U)
#define NETC_TMR_BASE_TMR_CTRL_ALM2P_SHIFT       (30U)
#define NETC_TMR_BASE_TMR_CTRL_ALM2P_WIDTH       (1U)
#define NETC_TMR_BASE_TMR_CTRL_ALM2P(x)          (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_CTRL_ALM2P_SHIFT)) & NETC_TMR_BASE_TMR_CTRL_ALM2P_MASK)

#define NETC_TMR_BASE_TMR_CTRL_ALM1P_MASK        (0x80000000U)
#define NETC_TMR_BASE_TMR_CTRL_ALM1P_SHIFT       (31U)
#define NETC_TMR_BASE_TMR_CTRL_ALM1P_WIDTH       (1U)
#define NETC_TMR_BASE_TMR_CTRL_ALM1P(x)          (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_CTRL_ALM1P_SHIFT)) & NETC_TMR_BASE_TMR_CTRL_ALM1P_MASK)
/*! @} */

/*! @name TMR_TEVENT - Timer Event */
/*! @{ */

#define NETC_TMR_BASE_TMR_TEVENT_PP3EN_MASK      (0x20U)
#define NETC_TMR_BASE_TMR_TEVENT_PP3EN_SHIFT     (5U)
#define NETC_TMR_BASE_TMR_TEVENT_PP3EN_WIDTH     (1U)
#define NETC_TMR_BASE_TMR_TEVENT_PP3EN(x)        (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_TEVENT_PP3EN_SHIFT)) & NETC_TMR_BASE_TMR_TEVENT_PP3EN_MASK)

#define NETC_TMR_BASE_TMR_TEVENT_PP2EN_MASK      (0x40U)
#define NETC_TMR_BASE_TMR_TEVENT_PP2EN_SHIFT     (6U)
#define NETC_TMR_BASE_TMR_TEVENT_PP2EN_WIDTH     (1U)
#define NETC_TMR_BASE_TMR_TEVENT_PP2EN(x)        (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_TEVENT_PP2EN_SHIFT)) & NETC_TMR_BASE_TMR_TEVENT_PP2EN_MASK)

#define NETC_TMR_BASE_TMR_TEVENT_PP1EN_MASK      (0x80U)
#define NETC_TMR_BASE_TMR_TEVENT_PP1EN_SHIFT     (7U)
#define NETC_TMR_BASE_TMR_TEVENT_PP1EN_WIDTH     (1U)
#define NETC_TMR_BASE_TMR_TEVENT_PP1EN(x)        (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_TEVENT_PP1EN_SHIFT)) & NETC_TMR_BASE_TMR_TEVENT_PP1EN_MASK)

#define NETC_TMR_BASE_TMR_TEVENT_ETS1_LOST_MASK  (0x8000U)
#define NETC_TMR_BASE_TMR_TEVENT_ETS1_LOST_SHIFT (15U)
#define NETC_TMR_BASE_TMR_TEVENT_ETS1_LOST_WIDTH (1U)
#define NETC_TMR_BASE_TMR_TEVENT_ETS1_LOST(x)    (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_TEVENT_ETS1_LOST_SHIFT)) & NETC_TMR_BASE_TMR_TEVENT_ETS1_LOST_MASK)

#define NETC_TMR_BASE_TMR_TEVENT_ALM1EN_MASK     (0x10000U)
#define NETC_TMR_BASE_TMR_TEVENT_ALM1EN_SHIFT    (16U)
#define NETC_TMR_BASE_TMR_TEVENT_ALM1EN_WIDTH    (1U)
#define NETC_TMR_BASE_TMR_TEVENT_ALM1EN(x)       (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_TEVENT_ALM1EN_SHIFT)) & NETC_TMR_BASE_TMR_TEVENT_ALM1EN_MASK)

#define NETC_TMR_BASE_TMR_TEVENT_ALM2EN_MASK     (0x20000U)
#define NETC_TMR_BASE_TMR_TEVENT_ALM2EN_SHIFT    (17U)
#define NETC_TMR_BASE_TMR_TEVENT_ALM2EN_WIDTH    (1U)
#define NETC_TMR_BASE_TMR_TEVENT_ALM2EN(x)       (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_TEVENT_ALM2EN_SHIFT)) & NETC_TMR_BASE_TMR_TEVENT_ALM2EN_MASK)

#define NETC_TMR_BASE_TMR_TEVENT_ETS1_THREN_MASK (0x100000U)
#define NETC_TMR_BASE_TMR_TEVENT_ETS1_THREN_SHIFT (20U)
#define NETC_TMR_BASE_TMR_TEVENT_ETS1_THREN_WIDTH (1U)
#define NETC_TMR_BASE_TMR_TEVENT_ETS1_THREN(x)   (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_TEVENT_ETS1_THREN_SHIFT)) & NETC_TMR_BASE_TMR_TEVENT_ETS1_THREN_MASK)

#define NETC_TMR_BASE_TMR_TEVENT_ETS2_THREN_MASK (0x200000U)
#define NETC_TMR_BASE_TMR_TEVENT_ETS2_THREN_SHIFT (21U)
#define NETC_TMR_BASE_TMR_TEVENT_ETS2_THREN_WIDTH (1U)
#define NETC_TMR_BASE_TMR_TEVENT_ETS2_THREN(x)   (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_TEVENT_ETS2_THREN_SHIFT)) & NETC_TMR_BASE_TMR_TEVENT_ETS2_THREN_MASK)

#define NETC_TMR_BASE_TMR_TEVENT_ETS1EN_MASK     (0x1000000U)
#define NETC_TMR_BASE_TMR_TEVENT_ETS1EN_SHIFT    (24U)
#define NETC_TMR_BASE_TMR_TEVENT_ETS1EN_WIDTH    (1U)
#define NETC_TMR_BASE_TMR_TEVENT_ETS1EN(x)       (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_TEVENT_ETS1EN_SHIFT)) & NETC_TMR_BASE_TMR_TEVENT_ETS1EN_MASK)

#define NETC_TMR_BASE_TMR_TEVENT_ETS2EN_MASK     (0x2000000U)
#define NETC_TMR_BASE_TMR_TEVENT_ETS2EN_SHIFT    (25U)
#define NETC_TMR_BASE_TMR_TEVENT_ETS2EN_WIDTH    (1U)
#define NETC_TMR_BASE_TMR_TEVENT_ETS2EN(x)       (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_TEVENT_ETS2EN_SHIFT)) & NETC_TMR_BASE_TMR_TEVENT_ETS2EN_MASK)

#define NETC_TMR_BASE_TMR_TEVENT_ETS1_OVEN_MASK  (0x10000000U)
#define NETC_TMR_BASE_TMR_TEVENT_ETS1_OVEN_SHIFT (28U)
#define NETC_TMR_BASE_TMR_TEVENT_ETS1_OVEN_WIDTH (1U)
#define NETC_TMR_BASE_TMR_TEVENT_ETS1_OVEN(x)    (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_TEVENT_ETS1_OVEN_SHIFT)) & NETC_TMR_BASE_TMR_TEVENT_ETS1_OVEN_MASK)

#define NETC_TMR_BASE_TMR_TEVENT_ETS2_OVEN_MASK  (0x20000000U)
#define NETC_TMR_BASE_TMR_TEVENT_ETS2_OVEN_SHIFT (29U)
#define NETC_TMR_BASE_TMR_TEVENT_ETS2_OVEN_WIDTH (1U)
#define NETC_TMR_BASE_TMR_TEVENT_ETS2_OVEN(x)    (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_TEVENT_ETS2_OVEN_SHIFT)) & NETC_TMR_BASE_TMR_TEVENT_ETS2_OVEN_MASK)
/*! @} */

/*! @name TMR_TEMASK - Timer Event Mask */
/*! @{ */

#define NETC_TMR_BASE_TMR_TEMASK_PP3EN_MASK      (0x20U)
#define NETC_TMR_BASE_TMR_TEMASK_PP3EN_SHIFT     (5U)
#define NETC_TMR_BASE_TMR_TEMASK_PP3EN_WIDTH     (1U)
#define NETC_TMR_BASE_TMR_TEMASK_PP3EN(x)        (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_TEMASK_PP3EN_SHIFT)) & NETC_TMR_BASE_TMR_TEMASK_PP3EN_MASK)

#define NETC_TMR_BASE_TMR_TEMASK_PP2EN_MASK      (0x40U)
#define NETC_TMR_BASE_TMR_TEMASK_PP2EN_SHIFT     (6U)
#define NETC_TMR_BASE_TMR_TEMASK_PP2EN_WIDTH     (1U)
#define NETC_TMR_BASE_TMR_TEMASK_PP2EN(x)        (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_TEMASK_PP2EN_SHIFT)) & NETC_TMR_BASE_TMR_TEMASK_PP2EN_MASK)

#define NETC_TMR_BASE_TMR_TEMASK_PP1EN_MASK      (0x80U)
#define NETC_TMR_BASE_TMR_TEMASK_PP1EN_SHIFT     (7U)
#define NETC_TMR_BASE_TMR_TEMASK_PP1EN_WIDTH     (1U)
#define NETC_TMR_BASE_TMR_TEMASK_PP1EN(x)        (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_TEMASK_PP1EN_SHIFT)) & NETC_TMR_BASE_TMR_TEMASK_PP1EN_MASK)

#define NETC_TMR_BASE_TMR_TEMASK_ETS1_LOST_EN_MASK (0x8000U)
#define NETC_TMR_BASE_TMR_TEMASK_ETS1_LOST_EN_SHIFT (15U)
#define NETC_TMR_BASE_TMR_TEMASK_ETS1_LOST_EN_WIDTH (1U)
#define NETC_TMR_BASE_TMR_TEMASK_ETS1_LOST_EN(x) (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_TEMASK_ETS1_LOST_EN_SHIFT)) & NETC_TMR_BASE_TMR_TEMASK_ETS1_LOST_EN_MASK)

#define NETC_TMR_BASE_TMR_TEMASK_ALM1EN_MASK     (0x10000U)
#define NETC_TMR_BASE_TMR_TEMASK_ALM1EN_SHIFT    (16U)
#define NETC_TMR_BASE_TMR_TEMASK_ALM1EN_WIDTH    (1U)
#define NETC_TMR_BASE_TMR_TEMASK_ALM1EN(x)       (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_TEMASK_ALM1EN_SHIFT)) & NETC_TMR_BASE_TMR_TEMASK_ALM1EN_MASK)

#define NETC_TMR_BASE_TMR_TEMASK_ALM2EN_MASK     (0x20000U)
#define NETC_TMR_BASE_TMR_TEMASK_ALM2EN_SHIFT    (17U)
#define NETC_TMR_BASE_TMR_TEMASK_ALM2EN_WIDTH    (1U)
#define NETC_TMR_BASE_TMR_TEMASK_ALM2EN(x)       (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_TEMASK_ALM2EN_SHIFT)) & NETC_TMR_BASE_TMR_TEMASK_ALM2EN_MASK)

#define NETC_TMR_BASE_TMR_TEMASK_ETS1_THREN_MASK (0x100000U)
#define NETC_TMR_BASE_TMR_TEMASK_ETS1_THREN_SHIFT (20U)
#define NETC_TMR_BASE_TMR_TEMASK_ETS1_THREN_WIDTH (1U)
#define NETC_TMR_BASE_TMR_TEMASK_ETS1_THREN(x)   (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_TEMASK_ETS1_THREN_SHIFT)) & NETC_TMR_BASE_TMR_TEMASK_ETS1_THREN_MASK)

#define NETC_TMR_BASE_TMR_TEMASK_ETS2_THREN_MASK (0x200000U)
#define NETC_TMR_BASE_TMR_TEMASK_ETS2_THREN_SHIFT (21U)
#define NETC_TMR_BASE_TMR_TEMASK_ETS2_THREN_WIDTH (1U)
#define NETC_TMR_BASE_TMR_TEMASK_ETS2_THREN(x)   (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_TEMASK_ETS2_THREN_SHIFT)) & NETC_TMR_BASE_TMR_TEMASK_ETS2_THREN_MASK)

#define NETC_TMR_BASE_TMR_TEMASK_ETS1EN_MASK     (0x1000000U)
#define NETC_TMR_BASE_TMR_TEMASK_ETS1EN_SHIFT    (24U)
#define NETC_TMR_BASE_TMR_TEMASK_ETS1EN_WIDTH    (1U)
#define NETC_TMR_BASE_TMR_TEMASK_ETS1EN(x)       (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_TEMASK_ETS1EN_SHIFT)) & NETC_TMR_BASE_TMR_TEMASK_ETS1EN_MASK)

#define NETC_TMR_BASE_TMR_TEMASK_ETS2EN_MASK     (0x2000000U)
#define NETC_TMR_BASE_TMR_TEMASK_ETS2EN_SHIFT    (25U)
#define NETC_TMR_BASE_TMR_TEMASK_ETS2EN_WIDTH    (1U)
#define NETC_TMR_BASE_TMR_TEMASK_ETS2EN(x)       (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_TEMASK_ETS2EN_SHIFT)) & NETC_TMR_BASE_TMR_TEMASK_ETS2EN_MASK)

#define NETC_TMR_BASE_TMR_TEMASK_ETS1_OVEN_MASK  (0x10000000U)
#define NETC_TMR_BASE_TMR_TEMASK_ETS1_OVEN_SHIFT (28U)
#define NETC_TMR_BASE_TMR_TEMASK_ETS1_OVEN_WIDTH (1U)
#define NETC_TMR_BASE_TMR_TEMASK_ETS1_OVEN(x)    (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_TEMASK_ETS1_OVEN_SHIFT)) & NETC_TMR_BASE_TMR_TEMASK_ETS1_OVEN_MASK)

#define NETC_TMR_BASE_TMR_TEMASK_ETS2_OVEN_MASK  (0x20000000U)
#define NETC_TMR_BASE_TMR_TEMASK_ETS2_OVEN_SHIFT (29U)
#define NETC_TMR_BASE_TMR_TEMASK_ETS2_OVEN_WIDTH (1U)
#define NETC_TMR_BASE_TMR_TEMASK_ETS2_OVEN(x)    (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_TEMASK_ETS2_OVEN_SHIFT)) & NETC_TMR_BASE_TMR_TEMASK_ETS2_OVEN_MASK)
/*! @} */

/*! @name TMR_MSIVEC - Timer MSI-X Vector */
/*! @{ */

