zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_TMR_BASE.h
#define NETC_TMR_BASE_TMR_MSIVEC_VECTOR_MASK     (0x1U)
#define NETC_TMR_BASE_TMR_MSIVEC_VECTOR_SHIFT    (0U)
#define NETC_TMR_BASE_TMR_MSIVEC_VECTOR_WIDTH    (1U)
#define NETC_TMR_BASE_TMR_MSIVEC_VECTOR(x)       (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_MSIVEC_VECTOR_SHIFT)) & NETC_TMR_BASE_TMR_MSIVEC_VECTOR_MASK)
/*! @} */

/*! @name TMR_STAT - Timer Status */
/*! @{ */

#define NETC_TMR_BASE_TMR_STAT_ETS1_VLD_MASK     (0x1000000U)
#define NETC_TMR_BASE_TMR_STAT_ETS1_VLD_SHIFT    (24U)
#define NETC_TMR_BASE_TMR_STAT_ETS1_VLD_WIDTH    (1U)
#define NETC_TMR_BASE_TMR_STAT_ETS1_VLD(x)       (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_STAT_ETS1_VLD_SHIFT)) & NETC_TMR_BASE_TMR_STAT_ETS1_VLD_MASK)

#define NETC_TMR_BASE_TMR_STAT_ETS2_VLD_MASK     (0x2000000U)
#define NETC_TMR_BASE_TMR_STAT_ETS2_VLD_SHIFT    (25U)
#define NETC_TMR_BASE_TMR_STAT_ETS2_VLD_WIDTH    (1U)
#define NETC_TMR_BASE_TMR_STAT_ETS2_VLD(x)       (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_STAT_ETS2_VLD_SHIFT)) & NETC_TMR_BASE_TMR_STAT_ETS2_VLD_MASK)

#define NETC_TMR_BASE_TMR_STAT_RCD_MASK          (0x80000000U)
#define NETC_TMR_BASE_TMR_STAT_RCD_SHIFT         (31U)
#define NETC_TMR_BASE_TMR_STAT_RCD_WIDTH         (1U)
#define NETC_TMR_BASE_TMR_STAT_RCD(x)            (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_STAT_RCD_SHIFT)) & NETC_TMR_BASE_TMR_STAT_RCD_MASK)
/*! @} */

/*! @name TMR_CNT_L - Timer Counter Low */
/*! @{ */

#define NETC_TMR_BASE_TMR_CNT_L_TMR_CNT_L_MASK   (0xFFFFFFFFU)
#define NETC_TMR_BASE_TMR_CNT_L_TMR_CNT_L_SHIFT  (0U)
#define NETC_TMR_BASE_TMR_CNT_L_TMR_CNT_L_WIDTH  (32U)
#define NETC_TMR_BASE_TMR_CNT_L_TMR_CNT_L(x)     (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_CNT_L_TMR_CNT_L_SHIFT)) & NETC_TMR_BASE_TMR_CNT_L_TMR_CNT_L_MASK)
/*! @} */

/*! @name TMR_CNT_H - Timer Counter High */
/*! @{ */

#define NETC_TMR_BASE_TMR_CNT_H_TMR_CNT_H_MASK   (0xFFFFFFFFU)
#define NETC_TMR_BASE_TMR_CNT_H_TMR_CNT_H_SHIFT  (0U)
#define NETC_TMR_BASE_TMR_CNT_H_TMR_CNT_H_WIDTH  (32U)
#define NETC_TMR_BASE_TMR_CNT_H_TMR_CNT_H(x)     (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_CNT_H_TMR_CNT_H_SHIFT)) & NETC_TMR_BASE_TMR_CNT_H_TMR_CNT_H_MASK)
/*! @} */

/*! @name TMR_ADD - Timer Addend */
/*! @{ */

#define NETC_TMR_BASE_TMR_ADD_ADDEND_MASK        (0xFFFFFFFFU)
#define NETC_TMR_BASE_TMR_ADD_ADDEND_SHIFT       (0U)
#define NETC_TMR_BASE_TMR_ADD_ADDEND_WIDTH       (32U)
#define NETC_TMR_BASE_TMR_ADD_ADDEND(x)          (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_ADD_ADDEND_SHIFT)) & NETC_TMR_BASE_TMR_ADD_ADDEND_MASK)
/*! @} */

/*! @name TMR_ACC - Timer Accumulator */
/*! @{ */

#define NETC_TMR_BASE_TMR_ACC_TMR_ACC_MASK       (0xFFFFFFFFU)
#define NETC_TMR_BASE_TMR_ACC_TMR_ACC_SHIFT      (0U)
#define NETC_TMR_BASE_TMR_ACC_TMR_ACC_WIDTH      (32U)
#define NETC_TMR_BASE_TMR_ACC_TMR_ACC(x)         (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_ACC_TMR_ACC_SHIFT)) & NETC_TMR_BASE_TMR_ACC_TMR_ACC_MASK)
/*! @} */

/*! @name TMR_PRSC - Timer Prescale */
/*! @{ */

#define NETC_TMR_BASE_TMR_PRSC_PRSC_OCK_MASK     (0xFFFFU)
#define NETC_TMR_BASE_TMR_PRSC_PRSC_OCK_SHIFT    (0U)
#define NETC_TMR_BASE_TMR_PRSC_PRSC_OCK_WIDTH    (16U)
#define NETC_TMR_BASE_TMR_PRSC_PRSC_OCK(x)       (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_PRSC_PRSC_OCK_SHIFT)) & NETC_TMR_BASE_TMR_PRSC_PRSC_OCK_MASK)
/*! @} */

/*! @name TMR_ECTRL - Extended Timer Control */
/*! @{ */

#define NETC_TMR_BASE_TMR_ECTRL_ETFF_THR_MASK    (0xFU)
#define NETC_TMR_BASE_TMR_ECTRL_ETFF_THR_SHIFT   (0U)
#define NETC_TMR_BASE_TMR_ECTRL_ETFF_THR_WIDTH   (4U)
#define NETC_TMR_BASE_TMR_ECTRL_ETFF_THR(x)      (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_ECTRL_ETFF_THR_SHIFT)) & NETC_TMR_BASE_TMR_ECTRL_ETFF_THR_MASK)
/*! @} */

/*! @name TMROFF_L - Timer Offset Low */
/*! @{ */

#define NETC_TMR_BASE_TMROFF_L_TMROFF_L_MASK     (0xFFFFFFFFU)
#define NETC_TMR_BASE_TMROFF_L_TMROFF_L_SHIFT    (0U)
#define NETC_TMR_BASE_TMROFF_L_TMROFF_L_WIDTH    (32U)
#define NETC_TMR_BASE_TMROFF_L_TMROFF_L(x)       (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMROFF_L_TMROFF_L_SHIFT)) & NETC_TMR_BASE_TMROFF_L_TMROFF_L_MASK)
/*! @} */

/*! @name TMROFF_H - Timer Offset High */
/*! @{ */

#define NETC_TMR_BASE_TMROFF_H_TMROFF_H_MASK     (0xFFFFFFFFU)
#define NETC_TMR_BASE_TMROFF_H_TMROFF_H_SHIFT    (0U)
#define NETC_TMR_BASE_TMROFF_H_TMROFF_H_WIDTH    (32U)
#define NETC_TMR_BASE_TMROFF_H_TMROFF_H(x)       (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMROFF_H_TMROFF_H_SHIFT)) & NETC_TMR_BASE_TMROFF_H_TMROFF_H_MASK)
/*! @} */

/*! @name TMR_ALARM_L - Alarm Time Comparator Low */
/*! @{ */

#define NETC_TMR_BASE_TMR_ALARM_L_ALARM_L_MASK   (0xFFFFFFFFU)
#define NETC_TMR_BASE_TMR_ALARM_L_ALARM_L_SHIFT  (0U)
#define NETC_TMR_BASE_TMR_ALARM_L_ALARM_L_WIDTH  (32U)
#define NETC_TMR_BASE_TMR_ALARM_L_ALARM_L(x)     (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_ALARM_L_ALARM_L_SHIFT)) & NETC_TMR_BASE_TMR_ALARM_L_ALARM_L_MASK)
/*! @} */

/*! @name TMR_ALARM_H - Alarm Time Comparator High */
/*! @{ */

#define NETC_TMR_BASE_TMR_ALARM_H_ALARM_H_MASK   (0xFFFFFFFFU)
#define NETC_TMR_BASE_TMR_ALARM_H_ALARM_H_SHIFT  (0U)
#define NETC_TMR_BASE_TMR_ALARM_H_ALARM_H_WIDTH  (32U)
#define NETC_TMR_BASE_TMR_ALARM_H_ALARM_H(x)     (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_ALARM_H_ALARM_H_SHIFT)) & NETC_TMR_BASE_TMR_ALARM_H_ALARM_H_MASK)
/*! @} */

/*! @name TMR_ALARM_CTRL - Timer Alarm Control */
/*! @{ */

#define NETC_TMR_BASE_TMR_ALARM_CTRL_ALARM1_PW_MASK (0x1FU)
#define NETC_TMR_BASE_TMR_ALARM_CTRL_ALARM1_PW_SHIFT (0U)
#define NETC_TMR_BASE_TMR_ALARM_CTRL_ALARM1_PW_WIDTH (5U)
#define NETC_TMR_BASE_TMR_ALARM_CTRL_ALARM1_PW(x) (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_ALARM_CTRL_ALARM1_PW_SHIFT)) & NETC_TMR_BASE_TMR_ALARM_CTRL_ALARM1_PW_MASK)

#define NETC_TMR_BASE_TMR_ALARM_CTRL_PG1_MASK    (0x80U)
#define NETC_TMR_BASE_TMR_ALARM_CTRL_PG1_SHIFT   (7U)
#define NETC_TMR_BASE_TMR_ALARM_CTRL_PG1_WIDTH   (1U)
#define NETC_TMR_BASE_TMR_ALARM_CTRL_PG1(x)      (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_ALARM_CTRL_PG1_SHIFT)) & NETC_TMR_BASE_TMR_ALARM_CTRL_PG1_MASK)

