zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_TMR_BASE.h
#define NETC_TMR_BASE_TMR_ALARM_CTRL_ALARM2_PW_MASK (0x1F00U)
#define NETC_TMR_BASE_TMR_ALARM_CTRL_ALARM2_PW_SHIFT (8U)
#define NETC_TMR_BASE_TMR_ALARM_CTRL_ALARM2_PW_WIDTH (5U)
#define NETC_TMR_BASE_TMR_ALARM_CTRL_ALARM2_PW(x) (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_ALARM_CTRL_ALARM2_PW_SHIFT)) & NETC_TMR_BASE_TMR_ALARM_CTRL_ALARM2_PW_MASK)

#define NETC_TMR_BASE_TMR_ALARM_CTRL_PG2_MASK    (0x8000U)
#define NETC_TMR_BASE_TMR_ALARM_CTRL_PG2_SHIFT   (15U)
#define NETC_TMR_BASE_TMR_ALARM_CTRL_PG2_WIDTH   (1U)
#define NETC_TMR_BASE_TMR_ALARM_CTRL_PG2(x)      (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_ALARM_CTRL_PG2_SHIFT)) & NETC_TMR_BASE_TMR_ALARM_CTRL_PG2_MASK)
/*! @} */

/*! @name TMR_FIPER - Timer Fixed-Interval Period */
/*! @{ */

#define NETC_TMR_BASE_TMR_FIPER_FIPER_MASK       (0xFFFFFFFFU)
#define NETC_TMR_BASE_TMR_FIPER_FIPER_SHIFT      (0U)
#define NETC_TMR_BASE_TMR_FIPER_FIPER_WIDTH      (32U)
#define NETC_TMR_BASE_TMR_FIPER_FIPER(x)         (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_FIPER_FIPER_SHIFT)) & NETC_TMR_BASE_TMR_FIPER_FIPER_MASK)
/*! @} */

/*! @name TMR_FIPER_CTRL - Timer FIPER Control */
/*! @{ */

#define NETC_TMR_BASE_TMR_FIPER_CTRL_FIPER1_PW_MASK (0x1FU)
#define NETC_TMR_BASE_TMR_FIPER_CTRL_FIPER1_PW_SHIFT (0U)
#define NETC_TMR_BASE_TMR_FIPER_CTRL_FIPER1_PW_WIDTH (5U)
#define NETC_TMR_BASE_TMR_FIPER_CTRL_FIPER1_PW(x) (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_FIPER_CTRL_FIPER1_PW_SHIFT)) & NETC_TMR_BASE_TMR_FIPER_CTRL_FIPER1_PW_MASK)

#define NETC_TMR_BASE_TMR_FIPER_CTRL_PG1_MASK    (0x40U)
#define NETC_TMR_BASE_TMR_FIPER_CTRL_PG1_SHIFT   (6U)
#define NETC_TMR_BASE_TMR_FIPER_CTRL_PG1_WIDTH   (1U)
#define NETC_TMR_BASE_TMR_FIPER_CTRL_PG1(x)      (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_FIPER_CTRL_PG1_SHIFT)) & NETC_TMR_BASE_TMR_FIPER_CTRL_PG1_MASK)

#define NETC_TMR_BASE_TMR_FIPER_CTRL_FIPER1_DIS_MASK (0x80U)
#define NETC_TMR_BASE_TMR_FIPER_CTRL_FIPER1_DIS_SHIFT (7U)
#define NETC_TMR_BASE_TMR_FIPER_CTRL_FIPER1_DIS_WIDTH (1U)
#define NETC_TMR_BASE_TMR_FIPER_CTRL_FIPER1_DIS(x) (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_FIPER_CTRL_FIPER1_DIS_SHIFT)) & NETC_TMR_BASE_TMR_FIPER_CTRL_FIPER1_DIS_MASK)

#define NETC_TMR_BASE_TMR_FIPER_CTRL_FIPER2_PW_MASK (0x1F00U)
#define NETC_TMR_BASE_TMR_FIPER_CTRL_FIPER2_PW_SHIFT (8U)
#define NETC_TMR_BASE_TMR_FIPER_CTRL_FIPER2_PW_WIDTH (5U)
#define NETC_TMR_BASE_TMR_FIPER_CTRL_FIPER2_PW(x) (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_FIPER_CTRL_FIPER2_PW_SHIFT)) & NETC_TMR_BASE_TMR_FIPER_CTRL_FIPER2_PW_MASK)

#define NETC_TMR_BASE_TMR_FIPER_CTRL_PG2_MASK    (0x4000U)
#define NETC_TMR_BASE_TMR_FIPER_CTRL_PG2_SHIFT   (14U)
#define NETC_TMR_BASE_TMR_FIPER_CTRL_PG2_WIDTH   (1U)
#define NETC_TMR_BASE_TMR_FIPER_CTRL_PG2(x)      (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_FIPER_CTRL_PG2_SHIFT)) & NETC_TMR_BASE_TMR_FIPER_CTRL_PG2_MASK)

#define NETC_TMR_BASE_TMR_FIPER_CTRL_FIPER2_DIS_MASK (0x8000U)
#define NETC_TMR_BASE_TMR_FIPER_CTRL_FIPER2_DIS_SHIFT (15U)
#define NETC_TMR_BASE_TMR_FIPER_CTRL_FIPER2_DIS_WIDTH (1U)
#define NETC_TMR_BASE_TMR_FIPER_CTRL_FIPER2_DIS(x) (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_FIPER_CTRL_FIPER2_DIS_SHIFT)) & NETC_TMR_BASE_TMR_FIPER_CTRL_FIPER2_DIS_MASK)

#define NETC_TMR_BASE_TMR_FIPER_CTRL_FIPER3_PW_MASK (0x1F0000U)
#define NETC_TMR_BASE_TMR_FIPER_CTRL_FIPER3_PW_SHIFT (16U)
#define NETC_TMR_BASE_TMR_FIPER_CTRL_FIPER3_PW_WIDTH (5U)
#define NETC_TMR_BASE_TMR_FIPER_CTRL_FIPER3_PW(x) (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_FIPER_CTRL_FIPER3_PW_SHIFT)) & NETC_TMR_BASE_TMR_FIPER_CTRL_FIPER3_PW_MASK)

#define NETC_TMR_BASE_TMR_FIPER_CTRL_PG3_MASK    (0x400000U)
#define NETC_TMR_BASE_TMR_FIPER_CTRL_PG3_SHIFT   (22U)
#define NETC_TMR_BASE_TMR_FIPER_CTRL_PG3_WIDTH   (1U)
#define NETC_TMR_BASE_TMR_FIPER_CTRL_PG3(x)      (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_FIPER_CTRL_PG3_SHIFT)) & NETC_TMR_BASE_TMR_FIPER_CTRL_PG3_MASK)

#define NETC_TMR_BASE_TMR_FIPER_CTRL_FIPER3_DIS_MASK (0x800000U)
#define NETC_TMR_BASE_TMR_FIPER_CTRL_FIPER3_DIS_SHIFT (23U)
#define NETC_TMR_BASE_TMR_FIPER_CTRL_FIPER3_DIS_WIDTH (1U)
#define NETC_TMR_BASE_TMR_FIPER_CTRL_FIPER3_DIS(x) (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_FIPER_CTRL_FIPER3_DIS_SHIFT)) & NETC_TMR_BASE_TMR_FIPER_CTRL_FIPER3_DIS_MASK)

#define NETC_TMR_BASE_TMR_FIPER_CTRL_RELAY_EN_MASK (0x1000000U)
#define NETC_TMR_BASE_TMR_FIPER_CTRL_RELAY_EN_SHIFT (24U)
#define NETC_TMR_BASE_TMR_FIPER_CTRL_RELAY_EN_WIDTH (1U)
#define NETC_TMR_BASE_TMR_FIPER_CTRL_RELAY_EN(x) (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_FIPER_CTRL_RELAY_EN_SHIFT)) & NETC_TMR_BASE_TMR_FIPER_CTRL_RELAY_EN_MASK)
/*! @} */

/*! @name TMR_ETTS_L - External Trigger Stamp Low */
/*! @{ */

#define NETC_TMR_BASE_TMR_ETTS_L_ETTS_L_MASK     (0xFFFFFFFFU)
#define NETC_TMR_BASE_TMR_ETTS_L_ETTS_L_SHIFT    (0U)
#define NETC_TMR_BASE_TMR_ETTS_L_ETTS_L_WIDTH    (32U)
#define NETC_TMR_BASE_TMR_ETTS_L_ETTS_L(x)       (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_ETTS_L_ETTS_L_SHIFT)) & NETC_TMR_BASE_TMR_ETTS_L_ETTS_L_MASK)
/*! @} */

/*! @name TMR_ETTS_H - External Trigger Stamp High */
/*! @{ */

#define NETC_TMR_BASE_TMR_ETTS_H_ETTS_H_MASK     (0xFFFFFFFFU)
#define NETC_TMR_BASE_TMR_ETTS_H_ETTS_H_SHIFT    (0U)
#define NETC_TMR_BASE_TMR_ETTS_H_ETTS_H_WIDTH    (32U)
#define NETC_TMR_BASE_TMR_ETTS_H_ETTS_H(x)       (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_ETTS_H_ETTS_H_SHIFT)) & NETC_TMR_BASE_TMR_ETTS_H_ETTS_H_MASK)
/*! @} */

/*! @name TMR_CUR_TIME_L - Timer Current Time Low */
/*! @{ */

#define NETC_TMR_BASE_TMR_CUR_TIME_L_TMR_CUR_TIME_L_MASK (0xFFFFFFFFU)
#define NETC_TMR_BASE_TMR_CUR_TIME_L_TMR_CUR_TIME_L_SHIFT (0U)
#define NETC_TMR_BASE_TMR_CUR_TIME_L_TMR_CUR_TIME_L_WIDTH (32U)
#define NETC_TMR_BASE_TMR_CUR_TIME_L_TMR_CUR_TIME_L(x) (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_CUR_TIME_L_TMR_CUR_TIME_L_SHIFT)) & NETC_TMR_BASE_TMR_CUR_TIME_L_TMR_CUR_TIME_L_MASK)
/*! @} */

/*! @name TMR_CUR_TIME_H - Timer Current Time High */
/*! @{ */

#define NETC_TMR_BASE_TMR_CUR_TIME_H_TMR_CUR_TIME_H_MASK (0xFFFFFFFFU)
#define NETC_TMR_BASE_TMR_CUR_TIME_H_TMR_CUR_TIME_H_SHIFT (0U)
#define NETC_TMR_BASE_TMR_CUR_TIME_H_TMR_CUR_TIME_H_WIDTH (32U)
#define NETC_TMR_BASE_TMR_CUR_TIME_H_TMR_CUR_TIME_H(x) (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_CUR_TIME_H_TMR_CUR_TIME_H_SHIFT)) & NETC_TMR_BASE_TMR_CUR_TIME_H_TMR_CUR_TIME_H_MASK)
/*! @} */

