zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_TMR_BASE.h
/*! @name TMR_PARAM - Timer Parameter */
/*! @{ */

#define NETC_TMR_BASE_TMR_PARAM_SYNC_MASK        (0x1U)
#define NETC_TMR_BASE_TMR_PARAM_SYNC_SHIFT       (0U)
#define NETC_TMR_BASE_TMR_PARAM_SYNC_WIDTH       (1U)
#define NETC_TMR_BASE_TMR_PARAM_SYNC(x)          (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_PARAM_SYNC_SHIFT)) & NETC_TMR_BASE_TMR_PARAM_SYNC_MASK)

#define NETC_TMR_BASE_TMR_PARAM_PARAM_VAL_MASK   (0xFFFFFFFEU)
#define NETC_TMR_BASE_TMR_PARAM_PARAM_VAL_SHIFT  (1U)
#define NETC_TMR_BASE_TMR_PARAM_PARAM_VAL_WIDTH  (31U)
#define NETC_TMR_BASE_TMR_PARAM_PARAM_VAL(x)     (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_PARAM_PARAM_VAL_SHIFT)) & NETC_TMR_BASE_TMR_PARAM_PARAM_VAL_MASK)
/*! @} */

/*! @name TM_CAPR - Timer Media Capability */
/*! @{ */

#define NETC_TMR_BASE_TM_CAPR_NUM_CH_MASK        (0x7U)
#define NETC_TMR_BASE_TM_CAPR_NUM_CH_SHIFT       (0U)
#define NETC_TMR_BASE_TM_CAPR_NUM_CH_WIDTH       (3U)
#define NETC_TMR_BASE_TM_CAPR_NUM_CH(x)          (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TM_CAPR_NUM_CH_SHIFT)) & NETC_TMR_BASE_TM_CAPR_NUM_CH_MASK)

#define NETC_TMR_BASE_TM_CAPR_NUM_MSIX_MASK      (0x10000U)
#define NETC_TMR_BASE_TM_CAPR_NUM_MSIX_SHIFT     (16U)
#define NETC_TMR_BASE_TM_CAPR_NUM_MSIX_WIDTH     (1U)
#define NETC_TMR_BASE_TM_CAPR_NUM_MSIX(x)        (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TM_CAPR_NUM_MSIX_SHIFT)) & NETC_TMR_BASE_TM_CAPR_NUM_MSIX_MASK)
/*! @} */

/*! @name PTCMR - Timer Control Mode 0..Timer Control Mode 3 */
/*! @{ */

#define NETC_TMR_BASE_PTCMR_TMODE_MASK           (0xFU)
#define NETC_TMR_BASE_PTCMR_TMODE_SHIFT          (0U)
#define NETC_TMR_BASE_PTCMR_TMODE_WIDTH          (4U)
#define NETC_TMR_BASE_PTCMR_TMODE(x)             (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_PTCMR_TMODE_SHIFT)) & NETC_TMR_BASE_PTCMR_TMODE_MASK)

#define NETC_TMR_BASE_PTCMR_TDRE_MASK            (0x10U)
#define NETC_TMR_BASE_PTCMR_TDRE_SHIFT           (4U)
#define NETC_TMR_BASE_PTCMR_TDRE_WIDTH           (1U)
#define NETC_TMR_BASE_PTCMR_TDRE(x)              (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_PTCMR_TDRE_SHIFT)) & NETC_TMR_BASE_PTCMR_TDRE_MASK)

#define NETC_TMR_BASE_PTCMR_THRESHOLD_MASK       (0x7E0U)
#define NETC_TMR_BASE_PTCMR_THRESHOLD_SHIFT      (5U)
#define NETC_TMR_BASE_PTCMR_THRESHOLD_WIDTH      (6U)
#define NETC_TMR_BASE_PTCMR_THRESHOLD(x)         (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_PTCMR_THRESHOLD_SHIFT)) & NETC_TMR_BASE_PTCMR_THRESHOLD_MASK)

#define NETC_TMR_BASE_PTCMR_TPCW_MASK            (0xF800U)
#define NETC_TMR_BASE_PTCMR_TPCW_SHIFT           (11U)
#define NETC_TMR_BASE_PTCMR_TPCW_WIDTH           (5U)
#define NETC_TMR_BASE_PTCMR_TPCW(x)              (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_PTCMR_TPCW_SHIFT)) & NETC_TMR_BASE_PTCMR_TPCW_MASK)
/*! @} */

/*! @name PTCSR - Timer Control Status 0..Timer Control Status 3 */
/*! @{ */

#define NETC_TMR_BASE_PTCSR_TF_MASK              (0x1U)
#define NETC_TMR_BASE_PTCSR_TF_SHIFT             (0U)
#define NETC_TMR_BASE_PTCSR_TF_WIDTH             (1U)
#define NETC_TMR_BASE_PTCSR_TF(x)                (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_PTCSR_TF_SHIFT)) & NETC_TMR_BASE_PTCSR_TF_MASK)

#define NETC_TMR_BASE_PTCSR_TRF_MASK             (0x2U)
#define NETC_TMR_BASE_PTCSR_TRF_SHIFT            (1U)
#define NETC_TMR_BASE_PTCSR_TRF_WIDTH            (1U)
#define NETC_TMR_BASE_PTCSR_TRF(x)               (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_PTCSR_TRF_SHIFT)) & NETC_TMR_BASE_PTCSR_TRF_MASK)

#define NETC_TMR_BASE_PTCSR_TTC_MASK             (0x4U)
#define NETC_TMR_BASE_PTCSR_TTC_SHIFT            (2U)
#define NETC_TMR_BASE_PTCSR_TTC_WIDTH            (1U)
#define NETC_TMR_BASE_PTCSR_TTC(x)               (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_PTCSR_TTC_SHIFT)) & NETC_TMR_BASE_PTCSR_TTC_MASK)

#define NETC_TMR_BASE_PTCSR_TAE_MASK             (0x8U)
#define NETC_TMR_BASE_PTCSR_TAE_SHIFT            (3U)
#define NETC_TMR_BASE_PTCSR_TAE_WIDTH            (1U)
#define NETC_TMR_BASE_PTCSR_TAE(x)               (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_PTCSR_TAE_SHIFT)) & NETC_TMR_BASE_PTCSR_TAE_MASK)
/*! @} */

/*! @name PTSTDR - Timestamp Transit Delay 0..Timestamp Transit Delay 3 */
/*! @{ */

#define NETC_TMR_BASE_PTSTDR_TD_MASK             (0xFFFFFFFFU)
#define NETC_TMR_BASE_PTSTDR_TD_SHIFT            (0U)
#define NETC_TMR_BASE_PTSTDR_TD_WIDTH            (32U)
#define NETC_TMR_BASE_PTSTDR_TD(x)               (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_PTSTDR_TD_SHIFT)) & NETC_TMR_BASE_PTSTDR_TD_MASK)
/*! @} */

/*! @name PTCCR - Timer Compare Capture 0..Timer Compare Capture 3 */
/*! @{ */

#define NETC_TMR_BASE_PTCCR_TCC_MASK             (0xFFFFFFFFU)
#define NETC_TMR_BASE_PTCCR_TCC_SHIFT            (0U)
#define NETC_TMR_BASE_PTCCR_TCC_WIDTH            (32U)
#define NETC_TMR_BASE_PTCCR_TCC(x)               (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_PTCCR_TCC_SHIFT)) & NETC_TMR_BASE_PTCCR_TCC_MASK)
/*! @} */

/*! @name PTSAUBAR - Timestamp Array Upper Base 0..Timestamp Array Upper Base 3 */
/*! @{ */

#define NETC_TMR_BASE_PTSAUBAR_BASE_UADDR_MASK   (0xFFFFFFFFU)
#define NETC_TMR_BASE_PTSAUBAR_BASE_UADDR_SHIFT  (0U)
#define NETC_TMR_BASE_PTSAUBAR_BASE_UADDR_WIDTH  (32U)
#define NETC_TMR_BASE_PTSAUBAR_BASE_UADDR(x)     (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_PTSAUBAR_BASE_UADDR_SHIFT)) & NETC_TMR_BASE_PTSAUBAR_BASE_UADDR_MASK)
/*! @} */

/*! @name PTSALBAR - Timestamp Array Lower Base 0..Timestamp Array Lower Base 3 */
/*! @{ */

#define NETC_TMR_BASE_PTSALBAR_BASE_LADDR_MASK   (0xFFFFFF00U)
#define NETC_TMR_BASE_PTSALBAR_BASE_LADDR_SHIFT  (8U)
#define NETC_TMR_BASE_PTSALBAR_BASE_LADDR_WIDTH  (24U)
#define NETC_TMR_BASE_PTSALBAR_BASE_LADDR(x)     (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_PTSALBAR_BASE_LADDR_SHIFT)) & NETC_TMR_BASE_PTSALBAR_BASE_LADDR_MASK)
/*! @} */

/*! @name PTSACIR - Timestamp Array Consumer Index 0..Timestamp Array Consumer Index 3 */
/*! @{ */

#define NETC_TMR_BASE_PTSACIR_CI_MASK            (0x7FU)
#define NETC_TMR_BASE_PTSACIR_CI_SHIFT           (0U)
#define NETC_TMR_BASE_PTSACIR_CI_WIDTH           (7U)
#define NETC_TMR_BASE_PTSACIR_CI(x)              (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_PTSACIR_CI_SHIFT)) & NETC_TMR_BASE_PTSACIR_CI_MASK)
/*! @} */

/*! @name PTSAPIR - Timestamp Array Producer Index 0..Timestamp Array Producer Index 3 */
/*! @{ */

#define NETC_TMR_BASE_PTSAPIR_PI_MASK            (0x7FU)
#define NETC_TMR_BASE_PTSAPIR_PI_SHIFT           (0U)
#define NETC_TMR_BASE_PTSAPIR_PI_WIDTH           (7U)
#define NETC_TMR_BASE_PTSAPIR_PI(x)              (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_PTSAPIR_PI_SHIFT)) & NETC_TMR_BASE_PTSAPIR_PI_MASK)
/*! @} */

/*! @name PIER - Interrupt Enable */
/*! @{ */

#define NETC_TMR_BASE_PIER_TF0IE_MASK            (0x1U)
#define NETC_TMR_BASE_PIER_TF0IE_SHIFT           (0U)
#define NETC_TMR_BASE_PIER_TF0IE_WIDTH           (1U)
#define NETC_TMR_BASE_PIER_TF0IE(x)              (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_PIER_TF0IE_SHIFT)) & NETC_TMR_BASE_PIER_TF0IE_MASK)

#define NETC_TMR_BASE_PIER_TRF0IE_MASK           (0x2U)
#define NETC_TMR_BASE_PIER_TRF0IE_SHIFT          (1U)
#define NETC_TMR_BASE_PIER_TRF0IE_WIDTH          (1U)
#define NETC_TMR_BASE_PIER_TRF0IE(x)             (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_PIER_TRF0IE_SHIFT)) & NETC_TMR_BASE_PIER_TRF0IE_MASK)

#define NETC_TMR_BASE_PIER_TTC0IE_MASK           (0x4U)
#define NETC_TMR_BASE_PIER_TTC0IE_SHIFT          (2U)
#define NETC_TMR_BASE_PIER_TTC0IE_WIDTH          (1U)
#define NETC_TMR_BASE_PIER_TTC0IE(x)             (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_PIER_TTC0IE_SHIFT)) & NETC_TMR_BASE_PIER_TTC0IE_MASK)

#define NETC_TMR_BASE_PIER_TAE0IE_MASK           (0x8U)
#define NETC_TMR_BASE_PIER_TAE0IE_SHIFT          (3U)
#define NETC_TMR_BASE_PIER_TAE0IE_WIDTH          (1U)
#define NETC_TMR_BASE_PIER_TAE0IE(x)             (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_PIER_TAE0IE_SHIFT)) & NETC_TMR_BASE_PIER_TAE0IE_MASK)

#define NETC_TMR_BASE_PIER_TF1IE_MASK            (0x10U)
#define NETC_TMR_BASE_PIER_TF1IE_SHIFT           (4U)
#define NETC_TMR_BASE_PIER_TF1IE_WIDTH           (1U)
#define NETC_TMR_BASE_PIER_TF1IE(x)              (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_PIER_TF1IE_SHIFT)) & NETC_TMR_BASE_PIER_TF1IE_MASK)

#define NETC_TMR_BASE_PIER_TRF1IE_MASK           (0x20U)
#define NETC_TMR_BASE_PIER_TRF1IE_SHIFT          (5U)
#define NETC_TMR_BASE_PIER_TRF1IE_WIDTH          (1U)
#define NETC_TMR_BASE_PIER_TRF1IE(x)             (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_PIER_TRF1IE_SHIFT)) & NETC_TMR_BASE_PIER_TRF1IE_MASK)

#define NETC_TMR_BASE_PIER_TTC1IE_MASK           (0x40U)
#define NETC_TMR_BASE_PIER_TTC1IE_SHIFT          (6U)
#define NETC_TMR_BASE_PIER_TTC1IE_WIDTH          (1U)
#define NETC_TMR_BASE_PIER_TTC1IE(x)             (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_PIER_TTC1IE_SHIFT)) & NETC_TMR_BASE_PIER_TTC1IE_MASK)

#define NETC_TMR_BASE_PIER_TAE1IE_MASK           (0x80U)
#define NETC_TMR_BASE_PIER_TAE1IE_SHIFT          (7U)
#define NETC_TMR_BASE_PIER_TAE1IE_WIDTH          (1U)
#define NETC_TMR_BASE_PIER_TAE1IE(x)             (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_PIER_TAE1IE_SHIFT)) & NETC_TMR_BASE_PIER_TAE1IE_MASK)

#define NETC_TMR_BASE_PIER_TF2IE_MASK            (0x100U)
#define NETC_TMR_BASE_PIER_TF2IE_SHIFT           (8U)
#define NETC_TMR_BASE_PIER_TF2IE_WIDTH           (1U)
#define NETC_TMR_BASE_PIER_TF2IE(x)              (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_PIER_TF2IE_SHIFT)) & NETC_TMR_BASE_PIER_TF2IE_MASK)

#define NETC_TMR_BASE_PIER_TRF2IE_MASK           (0x200U)
#define NETC_TMR_BASE_PIER_TRF2IE_SHIFT          (9U)
#define NETC_TMR_BASE_PIER_TRF2IE_WIDTH          (1U)
#define NETC_TMR_BASE_PIER_TRF2IE(x)             (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_PIER_TRF2IE_SHIFT)) & NETC_TMR_BASE_PIER_TRF2IE_MASK)

#define NETC_TMR_BASE_PIER_TTC2IE_MASK           (0x400U)
#define NETC_TMR_BASE_PIER_TTC2IE_SHIFT          (10U)
#define NETC_TMR_BASE_PIER_TTC2IE_WIDTH          (1U)
#define NETC_TMR_BASE_PIER_TTC2IE(x)             (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_PIER_TTC2IE_SHIFT)) & NETC_TMR_BASE_PIER_TTC2IE_MASK)

#define NETC_TMR_BASE_PIER_TAE2IE_MASK           (0x800U)
#define NETC_TMR_BASE_PIER_TAE2IE_SHIFT          (11U)
#define NETC_TMR_BASE_PIER_TAE2IE_WIDTH          (1U)
#define NETC_TMR_BASE_PIER_TAE2IE(x)             (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_PIER_TAE2IE_SHIFT)) & NETC_TMR_BASE_PIER_TAE2IE_MASK)

#define NETC_TMR_BASE_PIER_TF3IE_MASK            (0x1000U)
#define NETC_TMR_BASE_PIER_TF3IE_SHIFT           (12U)
#define NETC_TMR_BASE_PIER_TF3IE_WIDTH           (1U)
#define NETC_TMR_BASE_PIER_TF3IE(x)              (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_PIER_TF3IE_SHIFT)) & NETC_TMR_BASE_PIER_TF3IE_MASK)

#define NETC_TMR_BASE_PIER_TRF3IE_MASK           (0x2000U)
#define NETC_TMR_BASE_PIER_TRF3IE_SHIFT          (13U)
#define NETC_TMR_BASE_PIER_TRF3IE_WIDTH          (1U)
#define NETC_TMR_BASE_PIER_TRF3IE(x)             (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_PIER_TRF3IE_SHIFT)) & NETC_TMR_BASE_PIER_TRF3IE_MASK)

#define NETC_TMR_BASE_PIER_TTC3IE_MASK           (0x4000U)
#define NETC_TMR_BASE_PIER_TTC3IE_SHIFT          (14U)
#define NETC_TMR_BASE_PIER_TTC3IE_WIDTH          (1U)
#define NETC_TMR_BASE_PIER_TTC3IE(x)             (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_PIER_TTC3IE_SHIFT)) & NETC_TMR_BASE_PIER_TTC3IE_MASK)

#define NETC_TMR_BASE_PIER_TAE3IE_MASK           (0x8000U)
#define NETC_TMR_BASE_PIER_TAE3IE_SHIFT          (15U)
#define NETC_TMR_BASE_PIER_TAE3IE_WIDTH          (1U)
#define NETC_TMR_BASE_PIER_TAE3IE(x)             (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_PIER_TAE3IE_SHIFT)) & NETC_TMR_BASE_PIER_TAE3IE_MASK)
/*! @} */

/*! @name PIDR - Interrupt Detect */
/*! @{ */

#define NETC_TMR_BASE_PIDR_TF0_MASK              (0x1U)
#define NETC_TMR_BASE_PIDR_TF0_SHIFT             (0U)
#define NETC_TMR_BASE_PIDR_TF0_WIDTH             (1U)
#define NETC_TMR_BASE_PIDR_TF0(x)                (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_PIDR_TF0_SHIFT)) & NETC_TMR_BASE_PIDR_TF0_MASK)

#define NETC_TMR_BASE_PIDR_TRF0_MASK             (0x2U)
#define NETC_TMR_BASE_PIDR_TRF0_SHIFT            (1U)
#define NETC_TMR_BASE_PIDR_TRF0_WIDTH            (1U)
#define NETC_TMR_BASE_PIDR_TRF0(x)               (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_PIDR_TRF0_SHIFT)) & NETC_TMR_BASE_PIDR_TRF0_MASK)

#define NETC_TMR_BASE_PIDR_TTC0_MASK             (0x4U)
#define NETC_TMR_BASE_PIDR_TTC0_SHIFT            (2U)
#define NETC_TMR_BASE_PIDR_TTC0_WIDTH            (1U)
#define NETC_TMR_BASE_PIDR_TTC0(x)               (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_PIDR_TTC0_SHIFT)) & NETC_TMR_BASE_PIDR_TTC0_MASK)

#define NETC_TMR_BASE_PIDR_TAE0_MASK             (0x8U)
#define NETC_TMR_BASE_PIDR_TAE0_SHIFT            (3U)
#define NETC_TMR_BASE_PIDR_TAE0_WIDTH            (1U)
#define NETC_TMR_BASE_PIDR_TAE0(x)               (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_PIDR_TAE0_SHIFT)) & NETC_TMR_BASE_PIDR_TAE0_MASK)

#define NETC_TMR_BASE_PIDR_TF1_MASK              (0x10U)
#define NETC_TMR_BASE_PIDR_TF1_SHIFT             (4U)
#define NETC_TMR_BASE_PIDR_TF1_WIDTH             (1U)
#define NETC_TMR_BASE_PIDR_TF1(x)                (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_PIDR_TF1_SHIFT)) & NETC_TMR_BASE_PIDR_TF1_MASK)

#define NETC_TMR_BASE_PIDR_TRF1_MASK             (0x20U)
#define NETC_TMR_BASE_PIDR_TRF1_SHIFT            (5U)
#define NETC_TMR_BASE_PIDR_TRF1_WIDTH            (1U)
#define NETC_TMR_BASE_PIDR_TRF1(x)               (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_PIDR_TRF1_SHIFT)) & NETC_TMR_BASE_PIDR_TRF1_MASK)

#define NETC_TMR_BASE_PIDR_TTC1_MASK             (0x40U)
#define NETC_TMR_BASE_PIDR_TTC1_SHIFT            (6U)
#define NETC_TMR_BASE_PIDR_TTC1_WIDTH            (1U)
#define NETC_TMR_BASE_PIDR_TTC1(x)               (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_PIDR_TTC1_SHIFT)) & NETC_TMR_BASE_PIDR_TTC1_MASK)

#define NETC_TMR_BASE_PIDR_TAE1_MASK             (0x80U)
#define NETC_TMR_BASE_PIDR_TAE1_SHIFT            (7U)
#define NETC_TMR_BASE_PIDR_TAE1_WIDTH            (1U)
#define NETC_TMR_BASE_PIDR_TAE1(x)               (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_PIDR_TAE1_SHIFT)) & NETC_TMR_BASE_PIDR_TAE1_MASK)

#define NETC_TMR_BASE_PIDR_TF2_MASK              (0x100U)
#define NETC_TMR_BASE_PIDR_TF2_SHIFT             (8U)
#define NETC_TMR_BASE_PIDR_TF2_WIDTH             (1U)
#define NETC_TMR_BASE_PIDR_TF2(x)                (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_PIDR_TF2_SHIFT)) & NETC_TMR_BASE_PIDR_TF2_MASK)

#define NETC_TMR_BASE_PIDR_TRF2_MASK             (0x200U)
#define NETC_TMR_BASE_PIDR_TRF2_SHIFT            (9U)
#define NETC_TMR_BASE_PIDR_TRF2_WIDTH            (1U)
#define NETC_TMR_BASE_PIDR_TRF2(x)               (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_PIDR_TRF2_SHIFT)) & NETC_TMR_BASE_PIDR_TRF2_MASK)

#define NETC_TMR_BASE_PIDR_TTC2_MASK             (0x400U)
#define NETC_TMR_BASE_PIDR_TTC2_SHIFT            (10U)
#define NETC_TMR_BASE_PIDR_TTC2_WIDTH            (1U)
#define NETC_TMR_BASE_PIDR_TTC2(x)               (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_PIDR_TTC2_SHIFT)) & NETC_TMR_BASE_PIDR_TTC2_MASK)

