zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_TMR_BASE.h
#define NETC_TMR_BASE_PIDR_TAE2_MASK             (0x800U)
#define NETC_TMR_BASE_PIDR_TAE2_SHIFT            (11U)
#define NETC_TMR_BASE_PIDR_TAE2_WIDTH            (1U)
#define NETC_TMR_BASE_PIDR_TAE2(x)               (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_PIDR_TAE2_SHIFT)) & NETC_TMR_BASE_PIDR_TAE2_MASK)

#define NETC_TMR_BASE_PIDR_TF3_MASK              (0x1000U)
#define NETC_TMR_BASE_PIDR_TF3_SHIFT             (12U)
#define NETC_TMR_BASE_PIDR_TF3_WIDTH             (1U)
#define NETC_TMR_BASE_PIDR_TF3(x)                (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_PIDR_TF3_SHIFT)) & NETC_TMR_BASE_PIDR_TF3_MASK)

#define NETC_TMR_BASE_PIDR_TRF3_MASK             (0x2000U)
#define NETC_TMR_BASE_PIDR_TRF3_SHIFT            (13U)
#define NETC_TMR_BASE_PIDR_TRF3_WIDTH            (1U)
#define NETC_TMR_BASE_PIDR_TRF3(x)               (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_PIDR_TRF3_SHIFT)) & NETC_TMR_BASE_PIDR_TRF3_MASK)

#define NETC_TMR_BASE_PIDR_TTC3_MASK             (0x4000U)
#define NETC_TMR_BASE_PIDR_TTC3_SHIFT            (14U)
#define NETC_TMR_BASE_PIDR_TTC3_WIDTH            (1U)
#define NETC_TMR_BASE_PIDR_TTC3(x)               (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_PIDR_TTC3_SHIFT)) & NETC_TMR_BASE_PIDR_TTC3_MASK)

#define NETC_TMR_BASE_PIDR_TAE3_MASK             (0x8000U)
#define NETC_TMR_BASE_PIDR_TAE3_SHIFT            (15U)
#define NETC_TMR_BASE_PIDR_TAE3_WIDTH            (1U)
#define NETC_TMR_BASE_PIDR_TAE3(x)               (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_PIDR_TAE3_SHIFT)) & NETC_TMR_BASE_PIDR_TAE3_MASK)
/*! @} */

/*! @name PMSIVR - MSI-X Vector */
/*! @{ */

#define NETC_TMR_BASE_PMSIVR_VECTOR_CHAN0_MASK   (0x1U)
#define NETC_TMR_BASE_PMSIVR_VECTOR_CHAN0_SHIFT  (0U)
#define NETC_TMR_BASE_PMSIVR_VECTOR_CHAN0_WIDTH  (1U)
#define NETC_TMR_BASE_PMSIVR_VECTOR_CHAN0(x)     (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_PMSIVR_VECTOR_CHAN0_SHIFT)) & NETC_TMR_BASE_PMSIVR_VECTOR_CHAN0_MASK)

#define NETC_TMR_BASE_PMSIVR_VECTOR_CHAN1_MASK   (0x10U)
#define NETC_TMR_BASE_PMSIVR_VECTOR_CHAN1_SHIFT  (4U)
#define NETC_TMR_BASE_PMSIVR_VECTOR_CHAN1_WIDTH  (1U)
#define NETC_TMR_BASE_PMSIVR_VECTOR_CHAN1(x)     (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_PMSIVR_VECTOR_CHAN1_SHIFT)) & NETC_TMR_BASE_PMSIVR_VECTOR_CHAN1_MASK)

#define NETC_TMR_BASE_PMSIVR_VECTOR_CHAN2_MASK   (0x100U)
#define NETC_TMR_BASE_PMSIVR_VECTOR_CHAN2_SHIFT  (8U)
#define NETC_TMR_BASE_PMSIVR_VECTOR_CHAN2_WIDTH  (1U)
#define NETC_TMR_BASE_PMSIVR_VECTOR_CHAN2(x)     (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_PMSIVR_VECTOR_CHAN2_SHIFT)) & NETC_TMR_BASE_PMSIVR_VECTOR_CHAN2_MASK)

#define NETC_TMR_BASE_PMSIVR_VECTOR_CHAN3_MASK   (0x1000U)
#define NETC_TMR_BASE_PMSIVR_VECTOR_CHAN3_SHIFT  (12U)
#define NETC_TMR_BASE_PMSIVR_VECTOR_CHAN3_WIDTH  (1U)
#define NETC_TMR_BASE_PMSIVR_VECTOR_CHAN3(x)     (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_PMSIVR_VECTOR_CHAN3_SHIFT)) & NETC_TMR_BASE_PMSIVR_VECTOR_CHAN3_MASK)
/*! @} */

/*! @name TMR_CAR - Timer Interface Cache Attribute 0 */
/*! @{ */

#define NETC_TMR_BASE_TMR_CAR_WRCACHE_MASK       (0xF00U)
#define NETC_TMR_BASE_TMR_CAR_WRCACHE_SHIFT      (8U)
#define NETC_TMR_BASE_TMR_CAR_WRCACHE_WIDTH      (4U)
#define NETC_TMR_BASE_TMR_CAR_WRCACHE(x)         (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_CAR_WRCACHE_SHIFT)) & NETC_TMR_BASE_TMR_CAR_WRCACHE_MASK)

#define NETC_TMR_BASE_TMR_CAR_WRDOMAIN_MASK      (0x3000U)
#define NETC_TMR_BASE_TMR_CAR_WRDOMAIN_SHIFT     (12U)
#define NETC_TMR_BASE_TMR_CAR_WRDOMAIN_WIDTH     (2U)
#define NETC_TMR_BASE_TMR_CAR_WRDOMAIN(x)        (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_CAR_WRDOMAIN_SHIFT)) & NETC_TMR_BASE_TMR_CAR_WRDOMAIN_MASK)

#define NETC_TMR_BASE_TMR_CAR_WRSNP_MASK         (0x4000U)
#define NETC_TMR_BASE_TMR_CAR_WRSNP_SHIFT        (14U)
#define NETC_TMR_BASE_TMR_CAR_WRSNP_WIDTH        (1U)
#define NETC_TMR_BASE_TMR_CAR_WRSNP(x)           (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_CAR_WRSNP_SHIFT)) & NETC_TMR_BASE_TMR_CAR_WRSNP_MASK)

#define NETC_TMR_BASE_TMR_CAR_RDCACHE_MASK       (0xF000000U)
#define NETC_TMR_BASE_TMR_CAR_RDCACHE_SHIFT      (24U)
#define NETC_TMR_BASE_TMR_CAR_RDCACHE_WIDTH      (4U)
#define NETC_TMR_BASE_TMR_CAR_RDCACHE(x)         (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_CAR_RDCACHE_SHIFT)) & NETC_TMR_BASE_TMR_CAR_RDCACHE_MASK)

#define NETC_TMR_BASE_TMR_CAR_RDDOMAIN_MASK      (0x30000000U)
#define NETC_TMR_BASE_TMR_CAR_RDDOMAIN_SHIFT     (28U)
#define NETC_TMR_BASE_TMR_CAR_RDDOMAIN_WIDTH     (2U)
#define NETC_TMR_BASE_TMR_CAR_RDDOMAIN(x)        (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_CAR_RDDOMAIN_SHIFT)) & NETC_TMR_BASE_TMR_CAR_RDDOMAIN_MASK)

#define NETC_TMR_BASE_TMR_CAR_RDSNP_MASK         (0x40000000U)
#define NETC_TMR_BASE_TMR_CAR_RDSNP_SHIFT        (30U)
#define NETC_TMR_BASE_TMR_CAR_RDSNP_WIDTH        (1U)
#define NETC_TMR_BASE_TMR_CAR_RDSNP(x)           (((uint32_t)(((uint32_t)(x)) << NETC_TMR_BASE_TMR_CAR_RDSNP_SHIFT)) & NETC_TMR_BASE_TMR_CAR_RDSNP_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group NETC_TMR_BASE_Register_Masks */

/*!
 * @}
 */ /* end of group NETC_TMR_BASE_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_NETC_TMR_BASE_H_) */
